In [1]:
%load_ext sql

In [2]:
%sql sqlite:///library.db

'Connected: @library.db'

**The following code creates the databases**

In [3]:
%%sql
DROP TABLE IF EXISTS branches;
CREATE TABLE branches (
    branchID int NOT NULL,
    name varchar(250) NOT NULL,
    address varchar(250) NOT NULL,
    PRIMARY KEY (branchID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [16]:
%%sql
DROP TABLE IF EXISTS books;
CREATE TABLE books (
    bookID int NOT NULL,
    branchID int NOT NULL,
    title varchar(250) NOT NULL,
    authors varchar(250) NOT NULL,
    publisher varchar(250) NOT NULL,
    PRIMARY KEY (bookID),
    FOREIGN KEY (branchID) REFERENCES branches(branchID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [5]:
%%sql
DROP TABLE IF EXISTS borrowers;
CREATE TABLE borrowers (
    borrowerID int NOT NULL,
    name varchar(255) NOT NULL,
    address varchar(255),
    PRIMARY KEY (borrowerID)
);

SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [6]:
%%sql
DROP TABLE if EXISTS loans;
CREATE TABLE loans (
    loansID int NOT NULL,
    borrowerID int NOT NULL,
    bookID int NOT NULL,
    date date NOT NULL,
    dueDate date NOT NULL,
    PRIMARY KEY (loansID),
    FOREIGN KEY (borrowerID) REFERENCES borrowers(borrowerID)
    FOREIGN KEY (bookID) REFERENCES books(bookID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [7]:
%sql PRAGMA table_info(books);

 * sqlite:///library.db
Done.

[(0, 'bookID', 'int', 1, None, 1),
 (1, 'branchID', 'int', 1, None, 0),
 (2, 'authors', 'varchar(250)', 1, None, 0),
 (3, 'publisher', 'varchar(250)', 1, None, 0)]

In [8]:
%sql PRAGMA table_info(branches);

 * sqlite:///library.db
Done.

[(0, 'branchID', 'int', 1, None, 1),
 (1, 'name', 'varchar(250)', 1, None, 0),
 (2, 'address', 'varchar(250)', 1, None, 0)]

In [9]:
%sql PRAGMA table_info(borrowers);

 * sqlite:///library.db
Done.

[(0, 'borrowerID', 'int', 1, None, 1),
 (1, 'name', 'varchar(255)', 1, None, 0),
 (2, 'address', 'varchar(255)', 0, None, 0)]

In [10]:
%sql PRAGMA table_info(loans);

 * sqlite:///library.db
Done.

[(0, 'loansID', 'int', 1, None, 1),
 (1, 'borrowerID', 'int', 1, None, 0),
 (2, 'bookID', 'int', 1, None, 0),
 (3, 'date', 'date', 1, None, 0),
 (4, 'dueDate', 'date', 1, None, 0)]

In [11]:
%%sql
INSERT INTO branches (branchID, name, address)
VALUES ('11111', 'Oslo', 'Oslogata'),
('11112', 'Alesund', 'Alesundgata'),
('11113', 'Bergen', 'Bergengata');
SET NOCOUNT ON;

 * sqlite:///library.db
3 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [17]:
%%sql
INSERT INTO books (bookID, branchID, title, authors, publisher)
VALUES ('10', '11111', 'bok1', 'Sjur', 'NTNU'),
('12', '11111', 'bok2', 'Mathias', 'NTNU'),
('08', '11112', 'bok3', 'ingen', 'NTNU');
SET NOCOUNT ON;

 * sqlite:///library.db
3 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [19]:
%%sql
INSERT INTO borrowers (borrowerID, name, address)
VALUES ('1', 'Sjur', 'Hjemme'),
('2', 'Mathias', 'Borte');
SET NOCOUNT ON;

 * sqlite:///library.db
2 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [21]:
%%sql
INSERT INTO loans (loansID, borrowerID, bookID, date, dueDate)
VALUES ('123', '1', '10', '2021-02-21', '2021-05-21'),
('111', '2', '12','2021-04-19', '2021-09-19'),
('222', '2', '10', '2022-01-01', '2022-06-01');
SET NOCOUNT ON;

 * sqlite:///library.db
3 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [12]:
%sql SELECT * FROM branches;

 * sqlite:///library.db
Done.

[(11111, 'Oslo', 'Oslogata'),
 (11112, 'Alesund', 'Alesundgata'),
 (11113, 'Bergen', 'Bergengata')]

In [18]:
%sql SELECT * FROM books

 * sqlite:///library.db
Done.

[(10, 11111, 'bok1', 'Sjur', 'NTNU'),
 (12, 11111, 'bok2', 'Mathias', 'NTNU'),
 (8, 11112, 'bok3', 'ingen', 'NTNU')]

In [20]:
%sql SELECT * FROM borrowers

 * sqlite:///library.db
Done.

[(1, 'Sjur', 'Hjemme'), (2, 'Mathias', 'Borte')]

In [22]:
%sql SELECT * FROM loans

 * sqlite:///library.db
Done.

[(123, 1, 10, '2021-02-21', '2021-05-21'),
 (111, 2, 12, '2021-04-19', '2021-09-19'),
 (222, 2, 10, '2022-01-01', '2022-06-01')]